app/Controllers/Auth.php

    public function attemptLogin()
    {
        $session = session();
        $userModel = new UserModel();

        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        $user = $userModel->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = '123456@gmail.com'
 LIMIT 1